In [1]:
# Establish a connection between Python and the Sakila database.

In [1]:
#library needed for the connection. 

import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine
import getpass  # To get the password without showing the input
password = getpass.getpass()

········

In [2]:
#way to connect to database. in bd = put the db that we need.

bd = "sakila"
connection_string = 'mysql+pymysql://root:' + password + '@localhost/'+bd
engine = create_engine(connection_string)
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

In [3]:
from sqlalchemy import create_engine, MetaData

#show all tables: 
metadata = MetaData()

# Reflect the database tables
metadata.reflect(bind=engine)

# Get the table names
table_names = metadata.tables.keys()

# Print the table names
print("Tables in the database:")
for table_name in table_names:
    print(table_name)

Tables in the database:
actor
address
city
country
category
customer
store
staff
film
language
film_actor
film_category
film_text
inventory
payment
rental

/var/folders/k_/v5fd001j3bsfqngvdgmg9dg40000gn/T/ipykernel_1054/995820325.py:7: SAWarning: Did not recognize type 'geometry' of column 'location'
  metadata.reflect(bind=engine)

In [4]:
#query to see the table that I want to access

from sqlalchemy import text

with engine.connect() as connection:
    query = text('SELECT * FROM rental')
    result = connection.execute(query)

result

In [11]:
with engine.connect() as connection:
    query = text('SELECT * FROM rental')
    result = connection.execute(query)
    df1 = pd.DataFrame(result.all())

df1

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
16039,16045,2005-08-23 22:25:26,772,14,2005-08-25 23:54:26,1,2006-02-15 21:30:53
16040,16046,2005-08-23 22:26:47,4364,74,2005-08-27 18:02:47,2,2006-02-15 21:30:53
16041,16047,2005-08-23 22:42:48,2088,114,2005-08-25 02:48:48,2,2006-02-15 21:30:53
16042,16048,2005-08-23 22:43:07,2019,103,2005-08-31 21:33:07,1,2006-02-15 21:30:53
16043,16049,2005-08-23 22:50:12,2666,393,2005-08-30 01:01:12,2,2006-02-15 21:30:53

Write a Python function called rentals_month that retrieves rental data for a given month and year (passed as parameters) from the Sakila database as a Pandas DataFrame. The function should take in three parameters:

- `engine`: an object representing the database connection engine to be used to establish a connection to the Sakila database.
- `month`: an integer representing the month for which rental data is to be retrieved.
- `year`: an integer representing the year for which rental data is to be retrieved.

The function should execute a SQL query to retrieve the rental data for the specified month and year from the rental table in the Sakila database, and return it as a pandas DataFrame.

In [44]:
def rental_counts(month, year):
    with engine.connect() as connection:
        query = text(f'SELECT *, MONTH(rental_date) AS month, YEAR(rental_date) as year FROM rental WHERE MONTH(rental_date) = {month} AND YEAR(rental_date) = {year}')
        result = connection.execute(query)
        df_rental = pd.DataFrame(result.all())
        return df_rental

In [45]:
rental_counts_results = rental_counts(5,2005)

In [48]:
rental_counts_results.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,month,year
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,5,2005
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,5,2005
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,5,2005
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,5,2005
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,5,2005

Develop a Python function called rental_count_month that takes the DataFrame provided by rentals_month as input along with the month and year and returns a new DataFrame containing the number of rentals made by each customer_id during the selected month and year.

The function should also include the month and year as parameters and use them to name the new column according to the month and year, for example, if the input month is 05 and the year is 2005, the column name should be "rentals_05_2005".

Hint: Consider making use of pandas groupby()

In [52]:
def rental_count_month(df, month, year):
    column_name = f"rentals_{month}_{year}" 
    df = df.groupby('customer_id')["rental_id"].count().reset_index()
    df.rename(columns={'rental_id': column_name}, inplace=True)
    return df

In [53]:
rental_count_month_1 = rental_count_month(df, 5, 2005)
rental_count_month_1

     customer_id  rentals_5_2005
0              1              32
1              2              27
2              3              26
3              4              22
4              5              38
..           ...             ...
594          595              30
595          596              28
596          597              25
597          598              22
598          599              19

[599 rows x 2 columns]

In [54]:
rental_count_month_2 = rental_count_month(df, 2, 2006)
rental_count_month_2

     customer_id  rentals_2_2006
0              1              32
1              2              27
2              3              26
3              4              22
4              5              38
..           ...             ...
594          595              30
595          596              28
596          597              25
597          598              22
598          599              19

[599 rows x 2 columns]

Create a Python function called compare_rentals that takes two DataFrames as input containing the number of rentals made by each customer in different months and years. The function should return a combined DataFrame with a new 'difference' column, which is the difference between the number of rentals in the two months.

In [1]:
def compare_rentals(df_rental,df):
    pd.merge(df_rental, df, on='customer_id')
    merged_df['difference'] = merged_df[df1.columns[1]] - merged_df[df2.columns[1]]
    return merged_df